[
  {
    "id": "5516840b-281c-43bc-b464-0a6fca4dc783",
    "position": "Senior",
    "jobpositiondescription": "Senior OutSystems Developer",
    "imgurl": "/images/partners/Outsystems.png",
    "job": {
      "sections": [
        {
          "header": "Senior OutSystems Developer",
          "text": "",
          "bullets": [
            "We are searching for a highly motivated top performer to join our team as a Senior OutSystems Developer to help guide our development team, drive technological improvements by increasing our technical standards, optimize current processes and help create high standards across our products, data flow, product delivery processes, and customer facing assets.",
            "As a senior member of the development team, you will be responsible for the design and development of key software components for a diverse product line. You will have a high level of innovation, leadership, and planning. You will develop, optimize, and apply software solutions for and play a major role in advising management or formulating information technology strategy and policy."
          ]
        },
        {
          "header": "",
          "text": "What you'll be doing",
          "bullets": [
            "Performing coding assignments.",
            "Reviewing code work for accuracy and functionality.",
            "Creating and implementing design plans.",
            "Analyzing code segments regularly.",
            "Keeping up-to-date with industry trends and technology developments.",
            "Lead a team to manage application design, development, enhancements, break-fixes, standard application changes and maintenance activities.",
            "Develop and/or configure solutions following established timelines, application development standards and quality processes in projects.",
            "Assign and monitor the work for junior team members.",
            "Perform detailed reviews on deliverables.",
            "Create and run unit and automated testing scenarios",
            "Run the daily calls / scrum meetings and drive collaboration across locations.",
            "Interact with clients, coordinator / scrum master, onsite and offshore development and QA teams, support teams and other cross-functional teams.",
            "Communicate with client stakeholders to understand business and technical requirements and manage questions/clarifications.",
            "Manage dependencies with other teams and change requests.",
            "Perform ongoing team status reporting and build weekly status reports to be reviewed with the client and leadership.",
            "Identify and mitigate risk/issues and act as a first line of defense/escalation on any delivery issues.",
            "Handle real time issues occurred and drive through to resolution.",
            "Define and implement best practices and procedures.",
            "Mentor junior team members."

          ]
        },
        {
          "header": "",
          "text": "What you bring to the table:",
          "bullets": [
            "OutSystems certification - minimum level Associate Reactive Developer (OutSystems 11)",
            "OutSystems application configuration/development experience",
            "Experience leading or mentoring a small team with 3 - 5 members or more.",
            "Deep understanding of application design, development, support and enhancement lifecycle",
            "Strong track record working as a technical lead to perform process analysis, gather business requirements and develop/configure digital applications.",
            "Low code/no code application configuration/development experience",
            "Ability to develop solutions for client problems through application of personal experience and standard methods and tools.",
            "Ability to manage a small team of analysts/developers/configurators/testers for day-to-day work management.",
            "Experience working in software development life cycle (waterfall/Agile) across all phases including design, development, testing, implementation, deployment, maintenance.",
            "Experience managing service levels, metrics and status reporting.",
            "Ability to develop and maintain documentation of business processes/requirements/system enhancements.",
            "Database development skills",
            "Knowledge of coding standards, code reviews, source control management, build process, testing and operations.",
            "DevOps experience to deploy and maintain client projects.",
            "Full-Stack web application development experience.",
            "Experience designing modular, object-oriented programming.",
            "Experience developing for mobile platforms.",
            "Demonstrated ability and eagerness to learn new technical skills quickly.",
            "Solid analytical and critical thinking skills",
            "Strong problem solving and troubleshooting skills with the ability to exercise mature judgment.",
            "Exceptional interpersonal and communication skills (including oral, written and presentation skills).",
            "Ability to work in a dynamic, fast paced environment.",
            "Ability to work independently and manage multiple task assignments.",
            "Experience mentoring and/or training junior developers.",
            "Programming knowledge and/or experience with scripting languages:"
          ]
        },
        {
          "header": "",
          "text": "What we bring to the table (besides a paycheck)",
          "bullets": [
            "A healthy and fun work environment - we won't lie, sometimes the pressure is on and we have to deliver, but sometimes we are ahead of the game and we can take a break to have Taborda sponsored virtual team lunches or group challenges with prizes.",
            "Really great medical, dental, and visions benefits",
            "Did we mention fun?"
          ]
        }
      ],
      "contractterms": [
        "Full Time",
        "Hybrid"
      ],
      "tags": [
        "Outsystems",
        "Senior",
        "UI",
        "SQL Server"
      ]
    }
  },
  {
    "id": "ff57d9d1-e66e-4667-a881-bd4421700e61",
    "position": "Junior",
    "jobpositiondescription": "Junior OutSystems Developer",
    "imgurl": "/images/partners/Outsystems.png",
    "job": {
      "sections": [
        {
          "header": "Junior  OutSystems Developer",
          "text": "We are looking for a Junior OutSystems Developer who will be",
          "bullets": [
            "Joining the Service Delivery Division, working closely with Directors and (internal/external) stakeholders to ensure the success of providing technical solutions.",
            "Work closely with the client’s project development team and internal/external stakeholders to track and implement solutions that relate to quality or process improvements."
          ]
        },
        {
          "header": "",
          "text": "What you'll be doing",
          "bullets": [
            "Design, develop, and test web and mobile applications using the OutSystems low-code platforms, ensuring high performance and responsiveness.",
            "Collaborate with business analysts and project managers to understand project requirements and objectives.",
            "Customize and extend existing OutSystems applications to meet specific business needs.",
            "Create and maintain technical documentation for applications and processes.",
            "Troubleshoot and resolve software defects and technical issues in OutSystems applications in a timely manner.",
            "Contribute to the continuous improvement of development processes.",
            "Optimize and maintain the performance of applications.",
            "Stay up-to-date with OutSystems platform updates and best practices.",
            "Any other duties related to this role."
          ]
        },
        {
          "header": "",
          "text": "What you bring to the table:",
          "bullets": [
            "Bachelor's degree in Computer Science, Information Technology, or a related field.",
            "Proven experience as an OutSystems developer, with at least 2 years’ of experience.",
            "Strong knowledge of the OutSystems platform and its components, such as Service Studio, Integration Studio, and LifeTime.",
            "Experience in developing web and mobile applications using OutSystems, including UI/UX development, integration, and custom logic.",
            "Strong understanding of the software development life cycle and agile methodologies.",
            "Proficiency in web technologies, including HTML, CSS, JavaScript, and RESTful APIs.",
            "Integration experience with third-party systems and APIs.",
            "Experience withAgile/Scrum/Hybrid methodologies.",
            "Knowledge of database management and SQL.",
            "Experience with version control systems(e.g., Git).",
            "Familiarity with cloud platforms and DevOps practices.",
            "Strong problem-solving and analytical skills.",
            "Excellent communication and teamwork skills.",
            "Ability to work independently and collaborate in a team environment.",
            "Strong organizational and time management skills."
          ]
        },
        {
          "header": "",
          "text": "Good to have",
          "bullets": [
            "OutSystems Associate or Professional Developer certification is a plus.",
            "Knowledge of cybersecurity best practices in application development."
          ]
        }
      ],
      "contractterms": [
        "Full Time",
        "Hybrid"
      ],
      "tags": [
        "Outsystems",
        "Junior",
        "UI",
        "SQL Server"
      ]
    }
  }
]